runs/case_17/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
412358
(
(6.6012 0.000469525 0.000807412)
(6.60111 -0.000356857 -0.000375927)
(6.59916 -3.71727e-05 -0.000156892)
(6.59955 5.26026e-05 5.88143e-06)
(6.59962 -0.000131933 -0.000127824)
(6.59825 -0.00033022 -0.000341859)
(6.59918 0.000211439 0.000422077)
(6.59876 -0.000320739 -0.000268541)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (6.6 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    sides
    {
        type            slip;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    tailfin
    {
        type            noSlip;
    }
}


// ************************************************************************* //
